#Область ПрограммныйИнтерфейс
// Программно дополняет формы документов.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма документа.
Процедура ДополнитьФорму(Форма) Экспорт
	// Начало. Подколзина. Программное дополнение форм документов

	ИмяФормы = Форма.ИмяФормы;

	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда

		ДобавитьПолеКонтактноеЛицоВГруппуШапкаПраво(Форма);
		ДобавитьЭлементыСогласованнойСкидки(Форма);

	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда

		ДобавитьПолеКонтактноеЛицоВГруппуШапкаПраво(Форма);

	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда

		ДобавитьПолеКонтактноеЛицоВГруппуШапкаПраво(Форма);

	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда

		ВставитьПолеКонтактноеЛицоПередСуммойДокумента(Форма);

	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда

		ВставитьПолеКонтактноеЛицоПередСуммойДокумента(Форма);

	КонецЕсли;

	// Конец. Подколзина. Программное дополнение форм документов.
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьПолеКонтактноеЛицоВГруппуШапкаПраво(Форма)
	// Начало. Подколзина. Добавление поля контактного лица
	ПолеВвода = Форма.Элементы.Добавить(
		"ПЛ_КонтактноеЛицо",
		Тип("ПолеФормы"),
		Форма.Элементы.ГруппаШапкаПраво);

	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ПЛ_КонтактноеЛицо";
	ПолеВвода.Заголовок = "Контактное лицо";

	// Конец. Подколзина. Добавление поля контактного лица
КонецПроцедуры

Процедура ВставитьПолеКонтактноеЛицоПередСуммойДокумента(Форма)
	// Начало. Подколзина. Добавление поля контактного лица

	ПолеВвода = Форма.Элементы.Вставить(
		"ПЛ_КонтактноеЛицо",
		Тип("ПолеФормы"),,
		Форма.Элементы.СуммаДокумента);

	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ПЛ_КонтактноеЛицо";
	ПолеВвода.Заголовок = "Контактное лицо";

	// Конец. Подколзина. Добавление поля контактного лица
КонецПроцедуры

Процедура ДобавитьЭлементыСогласованнойСкидки(Форма)
	// Начало. Подколзина. Добавление элементов согласованной скидки

	ПолеСкидки = Форма.Элементы.Добавить(
		"ПЛ_СогласованнаяСкидка",
		Тип("ПолеФормы"),
		Форма.Элементы.ГруппаШапкаПраво);

	ПолеСкидки.Вид = ВидПоляФормы.ПолеВвода;
	ПолеСкидки.ПутьКДанным = "Объект.ПЛ_СогласованнаяСкидка";
	ПолеСкидки.Заголовок = "Согласованная скидка, %";
	ПолеСкидки.МаксимальноеЗначение = 100;

	ПолеСкидки.УстановитьДействие(
		"ПриИзменении",
		"Подключаемый_ПЛ_СогласованнаяСкидкаПриИзменении");

	КомандаПересчета = Форма.Команды.Добавить(
		"ПЛ_ПересчитатьСуммыСоСкидкой");

	КомандаПересчета.Действие =
		"Подключаемый_ПЛ_ПересчитатьСуммыСоСкидкой";
	КомандаПересчета.Заголовок = "Пересчитать таблицы";
	КомандаПересчета.ИзменяетСохраняемыеДанные = Истина;

	КнопкаПересчета = Форма.Элементы.Добавить(
		"ПЛ_ПересчитатьСуммыСоСкидкой",
		Тип("КнопкаФормы"),
		Форма.Элементы.ГруппаШапкаПраво);

	КнопкаПересчета.ИмяКоманды = КомандаПересчета.Имя;

	// Конец. Подколзина. Добавление элементов согласованной скидки
КонецПроцедуры

#КонецОбласти